
Функция ПолучитьЗначениеНастройки(ИмяНастройки) Экспорт
	
	Значение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AQ_Настройки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.AQ_Настройки КАК AQ_Настройки
		|ГДЕ
		|	AQ_Настройки.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", СокрЛП(ИмяНастройки));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Значение = ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат Значение;	
	
КонецФункции
