
#Область Механизмы_сервисов

Функция ВыполнитьЗапросИВернутьРезультат(ИдентификаторЗапроса,Параметры=Неопределено) 
	
	мРезультат	=	"";
	НС	=	Справочники.pbi_запросы.Вернуть_Запрос_поИдентификатору(ИдентификаторЗапроса);
	Если НС <> Неопределено Тогда		
		
		СтатистикаРаботы	=	новый Соответствие;	
		мСообщение = "";	
		мНачало = ТекущаяДата();
		мТипИсточника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НС,"ТипИсточника");	
		мТипИсточника =	?(ПустаяСтрока(мТипИсточника),"txt",мТипИсточника);

		СтруктураДанных = новый Структура("Запрос,Параметры,Сообщения,СтатистикаРаботы",НС,Параметры,мСообщение,СтатистикаРаботы);			
		
		мРезультат = AQ_Модуль.ВернутьРезультат(СтруктураДанных);						
	
		СтрокаСообщения	=	СтруктураДанных.Сообщения+Символы.ПС;
		
		Для каждого ТекЗначения из СтатистикаРаботы Цикл
			СтрокаСообщения	=	СтрокаСообщения+Символы.ПС+СтрШаблон("%1 : длительность %2 сек.",ТекЗначения.Ключ,ТекЗначения.Значение);			
		КонецЦикла;	
		
		ЗаписьЖурналаРегистрации("api_query",УровеньЖурналаРегистрации.Информация,,СтруктураДанных.Запрос,СокрЛП(СтрокаСообщения));
		
	КонецЕсли;			
	
	Возврат Новый Структура("Результат,Тип",мРезультат,мТипИсточника);	
	
КонецФункции

Функция ВернутьРезультатЗапроса_json(Запрос)
	СтруктураДанных = Неопределено;	
	Идентификатор =	Запрос.ПараметрыURL["json_query"];	
	ОшибкаСериализации = Ложь;
	
	Попытка
		Если Запрос.HTTPМетод = "GET" Тогда		
			СтруктураДанных = AQ_Модуль.ДесереализацияJSON(Идентификатор);
		ИначеЕсли Запрос.HTTPМетод = "POST" Тогда		
			СтруктураДанных = AQ_Модуль.ДесереализацияJSON(Запрос.ПолучитьТелоКакСтроку());		
		КонецЕсли;		
		Идентификатор = СтруктураДанных.id_api_query; 
		Параметры = СтруктураДанных.param;		
	Исключение
		СтруктураОтвета = Новый Структура("err",ОписаниеОшибки());			
	КонецПопытки;
	
	Если Не ОшибкаСериализации Тогда
		СтруктураОтвета = ВыполнитьЗапросИВернутьРезультат(Идентификатор,Параметры);			
	КонецЕсли;	
	
	Ответ = Новый HTTPСервисОтвет(200); 
	
	Если СтруктураОтвета.Тип = "html"  Тогда
		Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8"); 			
	ИначеЕсли СтруктураОтвета.Тип = "json" или  СтруктураОтвета.Тип = "txt" Тогда		
		Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8"); 		
	ИначеЕсли СтруктураОтвета.Тип = "xml" Тогда
		Ответ.Заголовки.Вставить("Content-type", "text/xml; charset=utf-8"); 		
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(СтруктураОтвета.Результат, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
	
	Возврат Ответ;	
КонецФункции

Функция ПолучитьДанныеПоЗапросуPost_Запрос(Запрос)	
	Возврат ВернутьРезультатЗапроса_json(Запрос);
КонецФункции

#КонецОбласти

