
&НаСервере
Функция ВернутьРезультат(СсылкаНаЗапрос,СтатистикаРаботы)			
	
	ТЧ_Параметры = СсылкаНаЗапрос.ТЧ_Параметры;
	
	Если ТЧ_Параметры.Количество()>0 Тогда
		СП	=	новый структура;
		Для каждого ТекСтрока из ТЧ_Параметры Цикл
			СП.Вставить(ТекСтрока.Ключ,ТекСтрока.Значение);		
		КонецЦикла;		
	КонецЕсли;		
	
	мСообщение = "";	
	СтруктураДанных = новый Структура("Запрос,Параметры,Сообщения,СтатистикаРаботы",СсылкаНаЗапрос,СП,мСообщение,СтатистикаРаботы);			
	
	Результат = AQ_Модуль.ВернутьРезультат(СтруктураДанных);				
	
	Если не ПустаяСтрока(СтруктураДанных.Сообщения) Тогда
		Сообщить(""+СтруктураДанных.Сообщения);	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ВернутьЗначение(Объект,Свойство)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, Свойство, Истина);
	
КонецФункции

&НаСервере
Функция СформироватьЗаголовок(СсылкаНаЗапрос,Длительность)
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЗапрос,"Наименование");
	возврат СтрШаблон("<%1> Проверка <%2>",Длительность,Наименование);
КонецФункции

&НаСервере
Процедура ВывестиСообщениеОСтатистике(СтатистикаРаботы)	
	Для каждого ТекЗначения из СтатистикаРаботы Цикл
		мСообщение	=	СтрШаблон("%1 : длительность %2 сек.",ТекЗначения.Ключ,ТекЗначения.Значение);
		Сообщить(мСообщение);
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	
	Если ВернутьЗначение(ПараметрКоманды,"ЭтоГруппа") Тогда	
		Возврат;
	КонецЕсли;
	
	
	СтатистикаРаботы = Новый Соответствие();
	
	мКлюч = "1) Общее время";
	СтатистикаРаботы.Вставить(мКлюч,ТекущаяДата());	
	
	мНачало = ТекущаяДата();	
	мТекст = ВернутьРезультат(ПараметрКоманды,СтатистикаРаботы);
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(мТекст);	
	СтатистикаРаботы[мКлюч] = ТекущаяДата()-СтатистикаРаботы[мКлюч];
	
	ВывестиСообщениеОСтатистике(СтатистикаРаботы);
	
	ТекстДок.показать(СформироватьЗаголовок(ПараметрКоманды,СтатистикаРаботы[мКлюч]));		
	
	
	
КонецПроцедуры

