

&НаСервере
Процедура ДополнитьПараметры_НаСервере(ДопПараметры)
		
	ЭтотОбъект.ВариантСсылка = Справочники.pbi_запросы.Вернуть_Вариант_поКлючу(КлючТекущегоВарианта);
	
	СКД	=	ПолучитьИзВременногоХранилища(ЭтотОбъект.НастройкиОтчета.АдресСхемы);
	ХМЛ_СКД = AQ_Модуль.ВернутьСхемуХМЛ_СКД(СКД);
	//1 вариант
	ХМЛ_СКД_настройки = AQ_Модуль.ВернутьСхемуХМЛ_СКД(КомпоновщикНастроек.ПолучитьНастройки());	
	//2 вариант когда не работает 1
	//ХМЛ_СКД_настройки = AQ_Модуль.ВернутьСхемуХМЛ_СКД(ЭтотОбъект.ВариантСсылка.Настройки.получить());
	
	АдресХранилищаХМЛ = ПоместитьВоВременноеХранилище(Новый Структура("ХМЛ_СКД,ХМЛ_СКД_настройки",ХМЛ_СКД,ХМЛ_СКД_настройки));
	
	ДопПараметры.Вставить("Транслит",AQ_Модуль.Транслит(ДопПараметры.Наименование));				
	ДопПараметры.Вставить("АдресХранилищаХМЛ",АдресХранилищаХМЛ);	
	
	НайденныйЗапрос = Справочники.pbi_запросы.Вернуть_Запрос_поИдентификатору(ДопПараметры.Транслит,ДопПараметры.Отчет);
	// найдем существующий элемент
	Если ЗначениеЗаполнено(НайденныйЗапрос) Тогда
		ДопПараметры.Вставить("Ключ",НайденныйЗапрос);
	КонецЕсли;		
	
КонецПроцедуры


&НаКлиенте
Процедура AQ_aq_ПеренестиВЗапросыПосле(Команда)
	
	ДопПараметры = Новый Структура("КлючТекущегоВарианта",ЭтотОбъект.КлючТекущегоВарианта);
	ДопПараметры.Вставить("Наименование",ЭтотОбъект.ВариантНаименование);
	ДопПараметры.Вставить("Отчет",Истина);
	ДопПараметры.Вставить("Заполнить",Истина);
	ДополнитьПараметры_НаСервере(ДопПараметры);
	ОткрытьФорму("Справочник.pbi_запросы.Форма.ФормаЭлемента",ДопПараметры,ЭтаФорма,ДопПараметры.Наименование);	
	
КонецПроцедуры


