


#Область Служебные_инструменты

Функция Вернуть_Вариант_поКлючу(Ключ) Экспорт
	
	мРезультат	=	Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.КлючВарианта = &КлючВарианта";
	
	Запрос.УстановитьПараметр("КлючВарианта", СокрЛП(Ключ));	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		мРезультат = ВыборкаДетальныеЗаписи.ссылка;
	КонецЕсли;
	
	Возврат мРезультат;
	
КонецФункции


Функция Вернуть_Запрос_поИдентификатору(Идентификатор_Запроса,ЭтоОтчет=Ложь) Экспорт
	
	мРезультат	=	Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	pbi_запросы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.pbi_запросы КАК pbi_запросы
	|ГДЕ
	|	pbi_запросы.Идентификатор = &Идентификатор
	|	И НЕ pbi_запросы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Идентификатор", СокрЛП(Идентификатор_Запроса));
	Запрос.УстановитьПараметр("Отчет", ЭтоОтчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		мРезультат = ВыборкаДетальныеЗаписи.ссылка;
	КонецЕсли;
	
	Возврат мРезультат;
	
КонецФункции

Функция ПолучитьТекстМакетаПоУмолчанию() Экспорт
	
	Возврат ПолучитьМакет("Макет_МодульПоУмолчанию").ПолучитьТекст();
	
КонецФункции


#КонецОбласти

#Область ОСНОВНЫЕ_АЛГОРИТМЫ

Функция ЗаписатьДанные(Данные,Представление) Экспорт
	
	Результат = Неопределено; 
	мИдентификатор = AQ_Модуль.Транслит(Представление);	
	
	Если Данные.Количество()>0 Тогда	
		
		//НС	=	Вернуть_Запрос_поИдентификатору(мИдентификатор);
		//Если НС	= Неопределено Тогда		
		//	НС = Справочники.pbi_запросы.СоздатьЭлемент();
		//Иначе
		//	НС = НС.Получитьобъект();			
		//КонецЕсли;		
		//
		//ДвоичныеДанныеMCR = УКО_MCRФормат.ДвоичныеДанныеMCR(Данные);
		//ЗаписываемыеДанные = Новый ХранилищеЗначения(ДвоичныеДанныеMCR, Новый СжатиеДанных(9));
		//
		//НС.ХранилищеДвоичныхДанных	=	ЗаписываемыеДанные;
		//НС.Наименование =	Представление;			
		//НС.Запись	=	СтрШаблон("%1 : %2",ПараметрыСеанса.текущийПользователь,Формат(ТекущаяДата(),"ДФ=dd/MM/yy"));		
		//НС.Идентификатор	=	мИдентификатор;		
		//НС.Записать();	
		//
		//Результат	=	Истина;
		
	КонецЕсли; 	
	
	возврат Результат;
	
КонецФункции

//вызывается из консоли запросов
//возврат запроса
Функция ЗагрузитьДанные(СсылкаНаЗапрос, УникальныйИдентификатор) Экспорт
	
	Результат	=	Неопределено;
	
	//Результат = УКО_MCRФорматВызовСервера.Прочитать(СсылкаНаЗапрос.ХранилищеДвоичныхДанных.Получить(), УникальныйИдентификатор);
	//Если Результат.Количество()>0 Тогда
	//	Для Каждого ТекЭлемента из Результат Цикл
	//		ТекЭлемента.Name	=	СокрЛП(СсылкаНаЗапрос.Наименование);				
	//	КонецЦикла;		
	//КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции



#КонецОбласти
