

Функция ПодготовитьДанныеДляЗаписи(СтруктураЗапроса) Экспорт
	
	Если СтруктураЗапроса <> Неопределено Тогда				
		ХМЛ_Данные= AQ_Модуль.Сериализовать(СтруктураЗапроса);							
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруИзХМЛ() Экспорт

	СтруктураЗапроса = AQ_Модуль.Десериализовать(ХМЛ_Данные);		
	
	Возврат СтруктураЗапроса;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если не ЭтоГруппа Тогда
		Запись = ""+ПараметрыСеанса.ТекущийПользователь+" от "+ТекущаяДатаСеанса();	
	КонецЕсли;	
	
КонецПроцедуры
